Repository: qi-xmu/mac-right-menu
Catalog: Shared/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: … and %@ more
zh_hans: … 还有 %@ 个

source: %@ ago
zh_hans: %@ 前

# %@ file%@
source: %1$@ file%2$@
zh_hans: %1$@ 个文件%2$@

source: • Add apps in the Apps tab
zh_hans: • 在「应用」标签页添加打开方式

source: • Add file templates in the File tab
zh_hans: • 在「文件」标签页添加文件模板

source: • Check extension status in the Extensions tab
zh_hans: • 在「扩展」标签页查看扩展连接状态

source: • Error alerts appear when an action fails
zh_hans: • 操作失败时会弹出错误提示

source: • Right-click files or empty space in Finder to use the menu
zh_hans: • 在 Finder 中右键文件或空白处，选择菜单操作

source: 1. Click “Open System Settings…” below
zh_hans: 1. 点击下方“打开系统设置…”

source: 2. Add %@ and enable it
zh_hans: 2. 添加 %@ 并启用

source: 3. Return here and click “Refresh”
zh_hans: 3. 返回此处并点击“刷新”

source: About
zh_hans: 关于

source: About Actions
zh_hans: 关于操作

source: Actions
zh_hans: 操作

source: Add
zh_hans: 添加

source: Add a running app
zh_hans: 添加运行中的应用

source: Add a template
zh_hans: 添加模板

source: Add an app from disk…
zh_hans: 从磁盘添加应用…

source: Add App...
zh_hans: 添加应用...

source: Add applications to open files with from the right-click menu.
zh_hans: 添加应用以从右键菜单打开文件。

source: Add custom actions to Finder right-click menu: create new files, open with apps, copy paths, toggle hidden files, and more.
zh_hans: 为 Finder 右键菜单添加自定义操作：新建文件、用指定应用打开、复制路径、切换隐藏文件等。

source: Add File Template
zh_hans: 添加文件模板

source: Add file templates for creating new files from the right-click menu.
zh_hans: 添加文件模板以从右键菜单创建新文件。

source: Add Template...
zh_hans: 添加模板...

source: Adds custom right-click menu items to Finder.
zh_hans: 向 Finder 添加自定义右键菜单项。

source: All
zh_hans: 全部

source: App released
zh_hans: 应用已释放

source: Applications
zh_hans: 应用程序

source: Apps
zh_hans: 应用

source: Auto-launch on start
zh_hans: 启动时自动拉起

source: Available Actions
zh_hans: 可用操作

source: Cancel
zh_hans: 取消

source: Cannot determine target folder
zh_hans: 无法确定目标文件夹

source: Check for Updates
zh_hans: 检查更新

source: Checking...
zh_hans: 检查中...

source: Clear
zh_hans: 清除

source: Click "Add App..." to add your first application.
zh_hans: 点击「添加应用...」以添加第一个应用。

source: Click "Add Template..." to create your first template.
zh_hans: 点击「添加模板...」以创建第一个模板。

source: Click + to add your first application.
zh_hans: 点击 + 添加第一个应用。

source: Click + to create your first template.
zh_hans: 点击 + 创建第一个模板。

source: Connected
zh_hans: 已连接

source: Connection
zh_hans: 连接

source: Copy File Name
zh_hans: 复制文件名

source: Copy only the file name to clipboard
zh_hans: 仅复制文件名到剪贴板

source: Copy Path
zh_hans: 复制路径

source: Copy the full file path to clipboard
zh_hans: 复制完整文件路径到剪贴板

source: Create a new file from templates
zh_hans: 从模板创建新文件

source: Custom command not implemented
zh_hans: 自定义命令尚未实现

source: Debug Log
zh_hans: 调试日志

source: Disable Always on Top
zh_hans: 取消置顶

source: Disabled
zh_hans: 已禁用

source: Disconnected
zh_hans: 未连接

source: Dismiss
zh_hans: 关闭

source: Display icons next to items in the right-click menu. App icons may significantly affect menu opening speed; disable 'Show App Icons' in the Apps tab if the menu feels slow.
zh_hans: 在右键菜单中各项旁显示图标。应用图标可能严重拖慢菜单打开速度；如菜单卡顿，请在「应用」标签页关闭「显示应用图标」。

source: Display SF Symbol icons next to action items (Copy Path, Copy File Name, etc.) in the right-click menu. Submenu headers are unaffected.
zh_hans: 在右键菜单的操作项（复制路径、复制文件名等）旁显示 SF Symbol 图标。不影响子菜单标题。

source: Display the application icon next to each app in the right-click menu.
zh_hans: 在右键菜单中每个应用旁显示应用图标。

source: Display the application icon next to each app in the right-click menu. Note: showing app icons has a significant performance impact and may slow down menu opening.
zh_hans: 在右键菜单中每个应用旁显示应用图标。注意：显示应用图标对性能影响较大，可能拖慢菜单打开速度。

source: Download & Install
zh_hans: 下载并安装

source: Download and install now? The app will quit after downloading.
zh_hans: 立即下载安装？App 将在下载后退出。

source: Downloading...
zh_hans: 下载中...

source: e.g. sh
zh_hans: 如 sh

source: Enable Always on Top
zh_hans: 置顶窗口

source: Enable Command Execution
zh_hans: 启用指令执行

source: Enable Finder Context Menu
zh_hans: 启用 Finder 右键菜单

source: Enabled
zh_hans: 已启用

source: Execution Failed
zh_hans: 执行失败

source: Execution Log
zh_hans: 执行日志

source: Export
zh_hans: 导出

source: Export cancelled
zh_hans: 导出已取消

source: Export Debug Log
zh_hans: 导出调试日志

source: Exported to %@
zh_hans: 已导出到 %@

source: Extension Connected
zh_hans: 扩展已连接

source: Extension is enabled but not yet running. Trigger a Finder right-click to start it.
zh_hans: 扩展已启用但尚未运行。在 Finder 中右键一次以启动它。

source: Extension Registered
zh_hans: 扩展已注册

source: Extension:
zh_hans: 扩展名：

source: Extensions
zh_hans: 扩展

source: File
zh_hans: 文件

source: Full Disk Access
zh_hans: 完全磁盘访问

source: General
zh_hans: 通用

source: Granted
zh_hans: 已授予

source: Grants access to files in all locations so copy / new file / open / shell commands work everywhere.
zh_hans: 授予访问任意位置文件的权限，使复制 / 新建文件 / 打开 / Shell 命令在所有位置都能正常工作。

source: Heartbeat ×%lld
zh_hans: 心跳 ×%lld

source: Heartbeat: %@ ago
zh_hans: 最后心跳：%@ 前

source: If an extension does not appear automatically, enable it in: System Settings → Privacy & Security → Extensions → Finder Extensions
zh_hans: 如果扩展未自动显示，请在以下位置启用： 系统设置 → 隐私与安全性 → 扩展 → Finder 扩展

source: If the extension does not appear automatically, enable it in: System Settings → Privacy & Security → Extensions → Finder Extensions
zh_hans: 如果扩展未自动显示，请在以下位置启用： 系统设置 → 隐私与安全性 → 扩展 → Finder 扩展

source: Last Heartbeat
zh_hans: 最后心跳

source: Later
zh_hans: 稍后

source: Lifecycle
zh_hans: 生命周期

source: Log Only
zh_hans: 仅记录

source: New File
zh_hans: 新建文件

source: New File Templates
zh_hans: 文件模板

source: New version %@ available!
zh_hans: 新版本 %@ 可用！

source: New version v%@ available!
zh_hans: 新版本 v%@ 可用！

source: No Apps Configured
zh_hans: 未配置应用

source: No Debug Records
zh_hans: 暂无调试记录

source: No Execution Records
zh_hans: 无执行记录

source: No files to open
zh_hans: 没有可打开的文件

source: No Records in This Category
zh_hans: 此分类暂无记录

source: No Templates
zh_hans: 无模板

source: Not Checked
zh_hans: 未检测

source: Not Granted
zh_hans: 未授予

source: Not Installed
zh_hans: 未安装

source: Not Registered
zh_hans: 未注册

source: Nothing to export — log is empty
zh_hans: 没有可导出的内容 — 日志为空

source: OK
zh_hans: 确定

source: Open in %@
zh_hans: 在 %@ 中打开

source: Open Parent Directory
zh_hans: 打开上层目录

source: Open Parent Folder
zh_hans: 打开上层文件夹

source: Open Settings
zh_hans: 打开设置

source: Open System Settings…
zh_hans: 打开“系统设置”…

source: Open the parent directory in Finder
zh_hans: 在 Finder 中打开上层目录

source: Open With
zh_hans: 打开方式

source: Open With Apps
zh_hans: 用应用打开

source: PID: %@
zh_hans: 进程 ID：%@

source: Quick Start
zh_hans: 使用说明

source: Quit
zh_hans: 退出

source: Re-check Full Disk Access status
zh_hans: 重新检测完全磁盘访问状态

source: Real-time record of every command received from the Extension.
zh_hans: 实时记录来自扩展的每一条命令执行结果。

source: Real-time record of RPC traffic and wake events (Con viewpoint).
zh_hans: 实时记录 RPC 通讯与唤醒事件（Con 视角）。

source: Records all RPC traffic and wake events. Off by default.
zh_hans: 记录所有 RPC 通讯与唤醒事件，默认关闭。

source: Records every command executed from Finder. On by default.
zh_hans: 记录从访达执行的每条命令，默认开启。

source: Refresh
zh_hans: 刷新

source: Registered
zh_hans: 已注册

source: Remove selected
zh_hans: 移除选中项

source: Reset
zh_hans: 重置

source: Reset all settings to defaults? This cannot be undone.
zh_hans: 将所有设置恢复为默认？此操作无法撤销。

source: Reset to Defaults
zh_hans: 恢复默认设置

source: Restart
zh_hans: 重启

source: RPC Address
zh_hans: RPC 监听地址

source: RPC messages and wake events will appear here.
zh_hans: RPC 消息与唤醒事件将显示在此处。

source: Save the debug log to a file
zh_hans: 将调试日志保存到文件

source: Select an application to open files with from Finder.
zh_hans: 选择从访达打开文件的应用。

source: Show
zh_hans: 显示

source: Show App Icons
zh_hans: 显示应用图标

source: Show Icons
zh_hans: 显示图标

source: Show Menu Icons
zh_hans: 显示菜单图标

source: Show or hide files in Finder
zh_hans: 在 Finder 中显示或隐藏文件

source: Switch the filter to see other categories.
zh_hans: 切换筛选条件以查看其他分类。

source: Template Name (e.g. Shell Script)
zh_hans: 模板名称（如 Shell 脚本）

source: Toggle Hidden
zh_hans: 切换隐藏

source: Toggle which actions appear in the right-click menu.
zh_hans: 切换哪些操作显示在右键菜单中。

source: Trigger a menu item in Finder to see results here.
zh_hans: 在 Finder 中触发一个菜单项即可在此查看结果。

source: Untitled
zh_hans: 未命名

source: Update check failed
zh_hans: 更新检查失败

source: Wake
zh_hans: 唤醒

source: When disabled, commands are logged but not executed.
zh_hans: 关闭时指令仅记录日志，不实际执行。

source: You're up to date!
zh_hans: 已是最新版本！
